py32-rs/py32-data/svd/PY32F403xx.svd
        <register>
          <name>SQR3</name>
          <description>desc SQR3</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>SQ1</name>
              <description>desc SQ1</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ2</name>
              <description>desc SQ2</description>
              <msb>9</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ3</name>
              <description>desc SQ3</description>
              <msb>14</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ4</name>
              <description>desc SQ4</description>
              <msb>19</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>L</name>
              <description>desc L</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>SQ5</name>
              <description>desc SQ5</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SQ6</name>
              <description>desc SQ6</description>
              <msb>29</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JSQR</name>
          <description>desc JSQR</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3FFFFF</resetMask>
          <fields>
            <field>
              <name>JSQ1</name>
              <description>desc JSQ1</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JSQ2</name>
              <description>desc JSQ2</description>
              <msb>9</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JSQ3</name>
              <description>desc JSQ3</description>
              <msb>14</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JSQ4</name>
              <description>desc JSQ4</description>
              <msb>19</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>JL</name>
              <description>desc JL</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR1</name>
          <description>desc JDR1</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>JDR1</name>
              <description>desc JDR1</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR2</name>
          <description>desc JDR2</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>JDR2</name>
              <description>desc JDR2</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR3</name>
          <description>desc JDR3</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>JDR3</name>
              <description>desc JDR3</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JDR4</name>
          <description>desc JDR4</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>JDR4</name>
              <description>desc JDR4</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>desc DR</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC2DATA</name>
              <description>desc ADC2DATA</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCSR</name>
          <description>desc CCSR</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC000F800</resetMask>
          <fields>
            <field>
              <name>CALSEL</name>
              <description>desc CALSEL</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALSMP</name>
              <description>desc CALSMP</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALBYP</name>
              <description>desc CALBYP</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALSET</name>
              <description>desc CALSET</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALFAIL</name>
              <description>desc CALFAIL</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALON</name>
              <description>desc CALON</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALRR1</name>
          <description>desc CALRR1</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>CALC10OUT</name>
              <description>desc CALC10OUT</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC11OUT</name>
              <description>desc CALC11OUT</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CALBOUT</name>
              <description>desc CALBOUT</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALRR2</name>
          <description>desc CALRR2</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CALC6OUT</name>
              <description>desc CALC6OUT</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC7OUT</name>
              <description>desc CALC7OUT</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC8OUT</name>
              <description>desc CALC8OUT</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CALC9OUT</name>
              <description>desc CALC9OUT</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFIR1</name>
          <description>desc CALFIR1</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>CALC10IO</name>
              <description>desc CALC10IO</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALC11IO</name>
              <description>desc CALC11IO</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALBIO</name>
              <description>desc CALBIO</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALFIR2</name>
          <description>desc CALFIR2</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CALC6IO</name>
              <description>desc CALC6IO</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALC7IO</name>
              <description>desc CALC7IO</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALC8IO</name>
              <description>desc CALC8IO</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALC9IO</name>
              <description>desc CALC9IO</description>
              <msb>31</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
