py32-rs/py32-data/svd/PY32F403xx.svd
        <register>
          <name>DR34</name>
          <description>desc DR34</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>desc D</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR35</name>
          <description>desc DR35</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>desc D</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR36</name>
          <description>desc DR36</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>desc D</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR37</name>
          <description>desc DR37</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>desc D</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR38</name>
          <description>desc DR38</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>desc D</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR39</name>
          <description>desc DR39</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>desc D</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR40</name>
          <description>desc DR40</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>desc D</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR41</name>
          <description>desc DR41</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>desc D</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR42</name>
          <description>desc DR42</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>D</name>
              <description>desc D</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CANFD</name>
      <description>desc CANFD</description>
      <groupName>CANFD</groupName>
      <baseAddress>0x40008000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CANFD_RX1</name>
        <description>desc CANFD_RX1</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>CANFD_SCE</name>
        <description>desc CANFD_SCE</description>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>TSNCR</name>
          <description>desc TSNCR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2010801</resetValue>
          <resetMask>0x307FFFF</resetMask>
          <fields>
            <field>
              <name>VERSION</name>
              <description>desc VERSION</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CES</name>
              <description>desc CES</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ROP</name>
              <description>desc ROP</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TMSE</name>
              <description>desc TMSE</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEN</name>
              <description>desc TSEN</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSPOS</name>
              <description>desc TSPOS</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ACBTR</name>
          <description>desc ACBTR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5050008</resetValue>
          <resetMask>0x7F7F01FF</resetMask>
          <fields>
            <field>
              <name>AC_SEG_1</name>
              <description>desc AC_SEG_1</description>
              <msb>8</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AC_SEG_2</name>
              <description>desc AC_SEG_2</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AC_SJW</name>
              <description>desc AC_SJW</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FDBTR</name>
          <description>desc FDBTR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2020003</resetValue>
          <resetMask>0x7F7F00FF</resetMask>
          <fields>
            <field>
              <name>FD_SEG_1</name>
              <description>desc FD_SEG_1</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FD_SEG_2</name>
              <description>desc FD_SEG_2</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FD_SJW</name>
              <description>desc FD_SJW</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XLBTR</name>
          <description>desc XLBTR</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2020003</resetValue>
          <resetMask>0x7F7F00FF</resetMask>
          <fields>
            <field>
              <name>XL_SEG_1</name>
              <description>desc XL_SEG_1</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>XL_SEG_2</name>
              <description>desc XL_SEG_2</description>
              <msb>22</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>XL_SJW</name>
              <description>desc XL_SJW</description>
              <msb>30</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RLSSP</name>
          <description>desc RLSSP</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x77000000</resetValue>
          <resetMask>0x77FFFF1F</resetMask>
          <fields>
            <field>
              <name>PRESC</name>
              <description>desc PRESC</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FD_SSPOFF</name>
              <description>desc FD_SSPOFF</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>XL_SSPOFF</name>
              <description>desc XL_SSPOFF</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>REALIM</name>
              <description>desc REALIM</description>
              <msb>26</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RETLIM</name>
              <description>desc RETLIM</description>
              <msb>30</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFR</name>
          <description>desc IFR</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xC007FFFF</resetMask>
          <fields>
            <field>
              <name>AIF</name>
              <description>desc AIF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EIF</name>
              <description>desc EIF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIF</name>
              <description>desc TSIF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TPIF</name>
              <description>desc TPIF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RAFIF</name>
              <description>desc RAFIF</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RFIF</name>
              <description>desc RFIF</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ROIF</name>
              <description>desc ROIF</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RIF</name>
              <description>desc RIF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BEIF</name>
              <description>desc BEIF</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALIF</name>
              <description>desc ALIF</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPIF</name>
              <description>desc EPIF</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TTIF</name>
              <description>desc TTIF</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIF</name>
              <description>desc TEIF</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WTIF</name>
              <description>desc WTIF</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MDWIF</name>
              <description>desc MDWIF</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MDEIF</name>
              <description>desc MDEIF</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MAEIF</name>
              <description>desc MAEIF</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SEIF</name>
              <description>desc SEIF</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SWIF</name>
              <description>desc SWIF</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPASS</name>
              <description>desc EPASS</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>EWARN</name>
              <description>desc EWARN</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>desc IER</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x468FE</resetValue>
          <resetMask>0x46FFE</resetMask>
          <fields>
            <field>
              <name>EIE</name>
              <description>desc EIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSIE</name>
              <description>desc TSIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TPIE</name>
              <description>desc TPIE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RAFIE</name>
              <description>desc RAFIE</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RFIE</name>
              <description>desc RFIE</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ROIE</name>
              <description>desc ROIE</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RIE</name>
              <description>desc RIE</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BEIE</name>
              <description>desc BEIE</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALIE</name>
              <description>desc ALIE</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EPIE</name>
              <description>desc EPIE</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TTIE</name>
              <description>desc TTIE</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WTIE</name>
              <description>desc WTIE</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MDWIE</name>
              <description>desc MDWIE</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SWIE</name>
              <description>desc SWIE</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSR</name>
          <description>desc TSR</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FF07FF</resetMask>
          <fields>
            <field>
              <name>HANDLE_L</name>
              <description>desc HANDLE_L</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTAT_L</name>
              <description>desc TSTAT_L</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HANDLE_H</name>
              <description>desc HANDLE_H</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TSTAT_H</name>
              <description>desc TSTAT_H</description>
              <msb>26</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TTSL</name>
          <description>desc TTSL</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TTS</name>
              <description>desc TTS</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TTSH</name>
          <description>desc TTSH</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TTS</name>
              <description>desc TTS</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
