py32-rs/py32-data/svd/PY32F403xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>desc CRC</description>
      <groupName>CRC</groupName>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <description>desc DR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DR</name>
              <description>desc DR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>desc IDR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>IDR</name>
              <description>desc IDR</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RESET</name>
              <description>desc RESET</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CTC</name>
      <description>desc CTC</description>
      <groupName>CTC</groupName>
      <baseAddress>0x4000C800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC_CTC</name>
        <description>RCC global Interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CTL0</name>
          <description>desc CTL0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2000</resetValue>
          <resetMask>0x3FEF</resetMask>
          <fields>
            <field>
              <name>CKOKIE</name>
              <description>desc CKOKIE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CKWARNIE</name>
              <description>desc CKWARNIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRIE</name>
              <description>desc ERRIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EREFIE</name>
              <description>desc EREFIE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CNTEN</name>
              <description>desc CNTEN</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOTRIM</name>
              <description>desc AUTOTRIM</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SWREFPUL</name>
              <description>desc SWREFPUL</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>TRIMVALUE</name>
              <description>desc TRIMVALUE</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL1</name>
          <description>desc CTL1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2022BB7F</resetValue>
          <resetMask>0xB7FFFFFF</resetMask>
          <fields>
            <field>
              <name>RLVALUE</name>
              <description>desc RLVALUE</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CKLIM</name>
              <description>desc CKLIM</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>REFPSC</name>
              <description>desc REFPSC</description>
              <msb>26</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>REFSEL</name>
              <description>desc REFSEL</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>REFPOL</name>
              <description>desc REFPOL</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF870F</resetMask>
          <fields>
            <field>
              <name>CKOKIF</name>
              <description>desc CKOKIF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CKWARNIF</name>
              <description>desc CKWARNIF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRIF</name>
              <description>desc ERRIF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>EREFIF</name>
              <description>desc EREFIF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CKERR</name>
              <description>desc CKERR</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>REFMISS</name>
              <description>desc REFMISS</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TRIMERR</name>
              <description>desc TRIMERR</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>REFDIR</name>
              <description>desc REFDIR</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>REFCAP</name>
              <description>desc REFCAP</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTC</name>
          <description>desc INTC</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>CKOKIC</name>
              <description>desc CKOKIC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>CKWARNIC</name>
              <description>desc CKWARNIC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>ERRIC</name>
              <description>desc ERRIC</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>EREFIC</name>
              <description>desc EREFIC</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
