py32-rs/py32-data/svd/PY32F403xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOA</name>
      <description>desc GPIO</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x48000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <description>desc MODER</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE0</name>
              <description>desc MODE0</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE1</name>
              <description>desc MODE1</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE2</name>
              <description>desc MODE2</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE3</name>
              <description>desc MODE3</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE4</name>
              <description>desc MODE4</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE5</name>
              <description>desc MODE5</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE6</name>
              <description>desc MODE6</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE7</name>
              <description>desc MODE7</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE8</name>
              <description>desc MODE8</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE9</name>
              <description>desc MODE9</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE10</name>
              <description>desc MODE10</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE11</name>
              <description>desc MODE11</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE12</name>
              <description>desc MODE12</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE13</name>
              <description>desc MODE13</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE14</name>
              <description>desc MODE14</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE15</name>
              <description>desc MODE15</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <description>desc OTYPER</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x44444444</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OT0</name>
              <description>desc OT0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT1</name>
              <description>desc OT1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT2</name>
              <description>desc OT2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT3</name>
              <description>desc OT3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT4</name>
              <description>desc OT4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT5</name>
              <description>desc OT5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT6</name>
              <description>desc OT6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT7</name>
              <description>desc OT7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT8</name>
              <description>desc OT8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT9</name>
              <description>desc OT9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT10</name>
              <description>desc OT10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT11</name>
              <description>desc OT11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT12</name>
              <description>desc OT12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT13</name>
              <description>desc OT13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT14</name>
              <description>desc OT14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OT15</name>
              <description>desc OT15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPEEDR</name>
          <description>desc OSPEEDR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>desc OSPEED0</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>desc OSPEED1</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>desc OSPEED2</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>desc OSPEED3</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>desc OSPEED4</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>desc OSPEED5</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED6</name>
              <description>desc OSPEED6</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED7</name>
              <description>desc OSPEED7</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED8</name>
              <description>desc OSPEED8</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED9</name>
              <description>desc OSPEED9</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED10</name>
              <description>desc OSPEED10</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED11</name>
              <description>desc OSPEED11</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED12</name>
              <description>desc OSPEED12</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED13</name>
              <description>desc OSPEED13</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED14</name>
              <description>desc OSPEED14</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OSPEED15</name>
              <description>desc OSPEED15</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <description>desc PUPDR</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>desc PUPD0</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD1</name>
              <description>desc PUPD1</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD2</name>
              <description>desc PUPD2</description>
              <msb>5</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD3</name>
              <description>desc PUPD3</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD4</name>
              <description>desc PUPD4</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD5</name>
              <description>desc PUPD5</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD6</name>
              <description>desc PUPD6</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD7</name>
              <description>desc PUPD7</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD8</name>
              <description>desc PUPD8</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD9</name>
              <description>desc PUPD9</description>
              <msb>19</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD10</name>
              <description>desc PUPD10</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD11</name>
              <description>desc PUPD11</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD12</name>
              <description>desc PUPD12</description>
              <msb>25</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD13</name>
              <description>desc PUPD13</description>
              <msb>27</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD14</name>
              <description>desc PUPD14</description>
              <msb>29</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPD15</name>
              <description>desc PUPD15</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>desc IDR</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ID0</name>
              <description>desc ID0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID1</name>
              <description>desc ID1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID2</name>
              <description>desc ID2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID3</name>
              <description>desc ID3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID4</name>
              <description>desc ID4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID5</name>
              <description>desc ID5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID6</name>
              <description>desc ID6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID7</name>
              <description>desc ID7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID8</name>
              <description>desc ID8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID9</name>
              <description>desc ID9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID10</name>
              <description>desc ID10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID11</name>
              <description>desc ID11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID12</name>
              <description>desc ID12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID13</name>
              <description>desc ID13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID14</name>
              <description>desc ID14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ID15</name>
              <description>desc ID15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
