py32-rs/py32-data/svd/PY32F403xx.svd
        <register>
          <name>ODR</name>
          <description>desc ODR</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>OD0</name>
              <description>desc OD0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD1</name>
              <description>desc OD1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD2</name>
              <description>desc OD2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD3</name>
              <description>desc OD3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD4</name>
              <description>desc OD4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD5</name>
              <description>desc OD5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD6</name>
              <description>desc OD6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD7</name>
              <description>desc OD7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD8</name>
              <description>desc OD8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD9</name>
              <description>desc OD9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD10</name>
              <description>desc OD10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD11</name>
              <description>desc OD11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD12</name>
              <description>desc OD12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD13</name>
              <description>desc OD13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD14</name>
              <description>desc OD14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OD15</name>
              <description>desc OD15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <description>desc BSRR</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BS0</name>
              <description>desc BS0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS1</name>
              <description>desc BS1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS2</name>
              <description>desc BS2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS3</name>
              <description>desc BS3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS4</name>
              <description>desc BS4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS5</name>
              <description>desc BS5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS6</name>
              <description>desc BS6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS7</name>
              <description>desc BS7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS8</name>
              <description>desc BS8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS9</name>
              <description>desc BS9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS10</name>
              <description>desc BS10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS11</name>
              <description>desc BS11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS12</name>
              <description>desc BS12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS13</name>
              <description>desc BS13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS14</name>
              <description>desc BS14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BS15</name>
              <description>desc BS15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR0</name>
              <description>desc BR0</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR1</name>
              <description>desc BR1</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR2</name>
              <description>desc BR2</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR3</name>
              <description>desc BR3</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR4</name>
              <description>desc BR4</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR5</name>
              <description>desc BR5</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR6</name>
              <description>desc BR6</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR7</name>
              <description>desc BR7</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR8</name>
              <description>desc BR8</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR9</name>
              <description>desc BR9</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR10</name>
              <description>desc BR10</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR11</name>
              <description>desc BR11</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR12</name>
              <description>desc BR12</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR13</name>
              <description>desc BR13</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR14</name>
              <description>desc BR14</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>BR15</name>
              <description>desc BR15</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <description>desc LCKR</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFFF</resetMask>
          <fields>
            <field>
              <name>LCK0</name>
              <description>desc LCK0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK1</name>
              <description>desc LCK1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK2</name>
              <description>desc LCK2</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK3</name>
              <description>desc LCK3</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK4</name>
              <description>desc LCK4</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK5</name>
              <description>desc LCK5</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK6</name>
              <description>desc LCK6</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK7</name>
              <description>desc LCK7</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK8</name>
              <description>desc LCK8</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK9</name>
              <description>desc LCK9</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK10</name>
              <description>desc LCK10</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK11</name>
              <description>desc LCK11</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK12</name>
              <description>desc LCK12</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK13</name>
              <description>desc LCK13</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK14</name>
              <description>desc LCK14</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCK15</name>
              <description>desc LCK15</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LCKK</name>
              <description>desc LCKK</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <description>desc AFRL</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>desc AFSEL0</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>desc AFSEL1</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>desc AFSEL2</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>desc AFSEL3</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>desc AFSEL4</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>desc AFSEL5</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>desc AFSEL6</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>desc AFSEL7</description>
              <msb>31</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <description>desc AFRH</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>desc AFSEL8</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>desc AFSEL9</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>desc AFSEL10</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>desc AFSEL11</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL12</name>
              <description>desc AFSEL12</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL13</name>
              <description>desc AFSEL13</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL14</name>
              <description>desc AFSEL14</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AFSEL15</name>
              <description>desc AFSEL15</description>
              <msb>31</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
