py32-rs/py32-data/svd/PY32F403xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="I2C1">
      <name>I2C2</name>
      <description>desc I2C</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C2_EV</name>
        <description>I2C2 Event Interrupt</description>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>I2C2_ER</name>
        <description>I2C2 Error Interrupt</description>
        <value>34</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>IWDG</name>
      <description>desc IWDG</description>
      <groupName>IWDG</groupName>
      <baseAddress>0x40003000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>KR</name>
          <description>desc KR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PR</name>
          <description>desc PR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>PR</name>
              <description>desc PR</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RLR</name>
          <description>desc RLR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFF</resetMask>
          <fields>
            <field>
              <name>RL</name>
              <description>desc RL</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>PVU</name>
              <description>desc PVU</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RVU</name>
              <description>desc RVU</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>desc PWR</description>
      <groupName>PWR</groupName>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PVD</name>
        <description>PVD through EXTI Line detection Interrupt</description>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x110000</resetValue>
          <resetMask>0x37E1FF</resetMask>
          <fields>
            <field>
              <name>LPDS</name>
              <description>desc LPDS</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PDDS</name>
              <description>desc PDDS</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CWUF</name>
              <description>desc CWUF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>CSBF</name>
              <description>desc CSBF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>PVDE</name>
              <description>desc PVDE</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLS</name>
              <description>desc PLS</description>
              <msb>7</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBP</name>
              <description>desc DBP</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>VOS</name>
              <description>desc VOS</description>
              <msb>14</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPVR_VOS</name>
              <description>desc BKPVR_VOS</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <description>desc HSION_CTRL</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLS_WUPT</name>
              <description>desc FLS_WUPT</description>
              <msb>18</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>STDBY_MRRDY_WAIT</name>
              <description>desc STDBY_MRRDY_WAIT</description>
              <msb>21</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>desc CSR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x83</resetValue>
          <resetMask>0xF1F07</resetMask>
          <fields>
            <field>
              <name>WUF</name>
              <description>desc WUF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF</name>
              <description>desc SBF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <description>desc PVDO</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>EWUP1</name>
              <description>desc EWUP1</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EWUP2</name>
              <description>desc EWUP2</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EWUP3</name>
              <description>desc EWUP3</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EWUP4</name>
              <description>desc EWUP4</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EWUP5</name>
              <description>desc EWUP5</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTDIS</name>
              <description>desc FLTDIS</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT_CTRL</name>
              <description>desc FLT_CTRL</description>
              <msb>19</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
