py32-rs/py32-data/svd/PY32F403xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>desc RCC</description>
      <groupName>RCC</groupName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC_CTC</name>
        <description>RCC global Interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>clock control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8083</resetValue>
          <resetMask>0x3EFFFFB</resetMask>
          <fields>
            <field>
              <name>HSION</name>
              <description>desc HSION</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIRDY</name>
              <description>desc HSIRDY</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSITRIM</name>
              <description>Internal high-speed clock trimming</description>
              <msb>7</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSICAL</name>
              <description>Internal high-speed clock calibration</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEON</name>
              <description>desc HSEON</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERDY</name>
              <description>desc HSERDY</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEBYP</name>
              <description>desc HSEBYP</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CSSON</name>
              <description>desc CSSON</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSICAL_</name>
              <description>Internal high-speed clock calibration</description>
              <msb>23</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLON</name>
              <description>PLL enable</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLRDY</name>
              <description>desc PLLRDY</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR</name>
          <description>clock configuration register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW</name>
              <description>desc SW</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SWS</name>
              <description>desc SWS</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HPRE</name>
              <description>desc HPRE</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PPRE1</name>
              <description>APB Low speed prescaler (APB1)</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PPRE2</name>
              <description>APB high-speed prescaler(APB2)</description>
              <msb>13</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPRE</name>
              <description>desc ADCPRE</description>
              <msb>15</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLSRC</name>
              <description>desc PLLSRC</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLXTPRE</name>
              <description>desc PLLXTPRE</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLMULL</name>
              <description>desc PLLMULL</description>
              <msb>21</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPRE</name>
              <description>desc USBPRE</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MCO</name>
              <description>desc MCO</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPRE_</name>
              <description>desc ADCPRE</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLMULL_</name>
              <description>desc PLLMULL</description>
              <msb>30</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USBPRE_</name>
              <description>desc USBPRE</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CIR</name>
          <description>clock interrupt register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xBF3FBF</resetMask>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <description>desc LSIRDYF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>LSERDYF</name>
              <description>desc LSERDYF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIRDYF</name>
              <description>desc HSIRDYF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSERDYF</name>
              <description>desc HSERDYF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLRDYF</name>
              <description>desc PLLRDYF</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSI48RDYF</name>
              <description>desc HSI48RDYF</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CSSF</name>
              <description>desc CSSF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDYIE</name>
              <description>desc LSIRDYIE</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDYIE</name>
              <description>desc LSERDYIE</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <description>desc HSIRDYIE</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERDYIE</name>
              <description>desc HSERDYIE</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <description>desc PLLRDYIE</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSI48RDYIE</name>
              <description>desc HSI48RDYIE</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDYC</name>
              <description>desc LSIRDYC</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>LSERDYC</name>
              <description>desc LSERDYC</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>HSIRDYC</name>
              <description>desc HSIRDYC</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>HSERDYC</name>
              <description>desc HSERDYC</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>PLLRDYC</name>
              <description>desc PLLRDYC</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>HSI48RDYC</name>
              <description>desc HSI48RDYC</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>CSSC</name>
              <description>desc CSSC</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2RSTR</name>
          <description>APB2 peripheral reset register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x38FE01</resetMask>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <description>desc SYSCFGRST</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1RST</name>
              <description>desc ADC1RST</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2RST</name>
              <description>desc ADC2RST</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM1RST</name>
              <description>desc TIM1RST</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1RST</name>
              <description>desc SPI1RST</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM8RST</name>
              <description>desc TIM8RST</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART1RST</name>
              <description>desc USART1RST</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC3RST</name>
              <description>desc ADC3RST</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM9RST</name>
              <description>desc TIM9RST</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM10RST</name>
              <description>desc TIM10RST</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM11RST</name>
              <description>desc TIM11RST</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1RSTR</name>
          <description>APB1 peripheral reset register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFAFEC9FF</resetMask>
          <fields>
            <field>
              <name>TIM2RST</name>
              <description>desc TIM2RST</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM3RST</name>
              <description>desc TIM3RST</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM4RST</name>
              <description>desc TIM4RST</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM5RST</name>
              <description>desc TIM5RST</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM6RST</name>
              <description>desc TIM6RST</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM7RST</name>
              <description>desc TIM7RST</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM12RST</name>
              <description>desc TIM12RST</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM13RST</name>
              <description>desc TIM13RST</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM14RST</name>
              <description>desc TIM14RST</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDGRST</name>
              <description>desc WWDGRST</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2RST</name>
              <description>desc SPI2RST</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3RST</name>
              <description>desc SPI3RST</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART2RST</name>
              <description>desc USART2RST</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART3RST</name>
              <description>desc USART3RST</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART4RST</name>
              <description>desc USART4RST</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART5RST</name>
              <description>desc USART5RST</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1RST</name>
              <description>desc I2C1RST</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2RST</name>
              <description>desc I2C2RST</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USBRST</name>
              <description>desc USBRST</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CANRST</name>
              <description>desc CANRST</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPRST</name>
              <description>desc BKPRST</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRRST</name>
              <description>desc PWRRST</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTCRST</name>
              <description>desc CTCRST</description>
              <msb>31</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1ENR</name>
          <description>AHB1 peripheral clock register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x14</resetValue>
          <resetMask>0x1457</resetMask>
          <fields>
            <field>
              <name>DMA1EN</name>
              <description>desc DMA1EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2EN</name>
              <description>desc DMA2EN</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAMEN</name>
              <description>desc SRAMEN</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FMCEN</name>
              <description>desc FMCEN</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCEN</name>
              <description>desc CRCEN</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIOEN</name>
              <description>desc SDIOEN</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ESMCEN</name>
              <description>desc ESMCEN</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
