py32-rs/py32-data/svd/PY32F403xx.svd
        <register>
          <name>APB2ENR</name>
          <description>APB2 peripheral clock enable register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x38FE01</resetMask>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <description>desc SYSCFGEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1EN</name>
              <description>desc ADC1EN</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2EN</name>
              <description>desc ADC2EN</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM1EN</name>
              <description>desc TIM1EN</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI1EN</name>
              <description>desc SPI1EN</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM8EN</name>
              <description>desc TIM8EN</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART1EN</name>
              <description>desc USART1EN</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC3EN</name>
              <description>desc ADC3EN</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM9EN</name>
              <description>desc TIM9EN</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM10EN</name>
              <description>desc TIM10EN</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM11EN</name>
              <description>desc TIM11EN</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1ENR</name>
          <description>APB1 peripheral clock enable register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x14</resetValue>
          <resetMask>0xBAFEC9FF</resetMask>
          <fields>
            <field>
              <name>TIM2EN</name>
              <description>desc TIM2EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM3EN</name>
              <description>desc TIM3EN</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM4EN</name>
              <description>desc TIM4EN</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM5EN</name>
              <description>desc TIM5EN</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM6EN</name>
              <description>desc TIM6EN</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM7EN</name>
              <description>desc TIM7EN</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM12EN</name>
              <description>desc TIM12EN</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM13EN</name>
              <description>desc TIM13EN</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIM14EN</name>
              <description>desc TIM14EN</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDGEN</name>
              <description>desc WWDGEN</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI2EN</name>
              <description>desc SPI2EN</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI3EN</name>
              <description>desc SPI3EN</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART2EN</name>
              <description>desc USART2EN</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART3EN</name>
              <description>desc USART3EN</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART4EN</name>
              <description>desc USART4EN</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USART5EN</name>
              <description>desc USART5EN</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1EN</name>
              <description>desc I2C1EN</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C2EN</name>
              <description>desc I2C2EN</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>USBEN</name>
              <description>desc USBEN</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CANEN</name>
              <description>desc CANEN</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BKPEN</name>
              <description>desc BKPEN</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PWREN</name>
              <description>desc PWREN</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CTCEN</name>
              <description>desc CTCEN</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <description>Backup domain control register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1837F</resetMask>
          <fields>
            <field>
              <name>LSEON</name>
              <description>desc LSEON</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSERDY</name>
              <description>desc LSERDY</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>LSEBYP</name>
              <description>desc LSEBYP</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSEDRV</name>
              <description>desc LSEDRV</description>
              <msb>4</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSESTART</name>
              <description>desc LSESTART</description>
              <msb>6</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCSEL</name>
              <description>desc RTCSEL</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCEN</name>
              <description>desc RTCEN</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BDRST</name>
              <description>desc BDRST</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>clock control &amp; status register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC000000</resetValue>
          <resetMask>0xFF000003</resetMask>
          <fields>
            <field>
              <name>LSION</name>
              <description>desc LSION</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>desc LSIRDY</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RMVF</name>
              <description>desc RMVF</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OBLRSTF</name>
              <description>desc OBLRSTF</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>desc PINRSTF</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>desc PORRSTF</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>desc SFTRSTF</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <description>desc IWDGRSTF</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <description>desc WWDGRSTF</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <description>desc LPWRRSTF</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1</name>
          <description>clock configuration register 1</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10808000</resetValue>
          <resetMask>0xFFFFFE37</resetMask>
          <fields>
            <field>
              <name>MCOPRE</name>
              <description>desc MCOPRE</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSI48ON</name>
              <description>desc HSI48ON</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSI48RDY</name>
              <description>desc HSI48RDY</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>HSI48TRIM</name>
              <description>desc HSI48TRIM</description>
              <msb>15</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSI48CAL</name>
              <description>desc HSI48CAL</description>
              <msb>28</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>USBSELHSI48</name>
              <description>desc USBSELHSI48</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1RSTR</name>
          <description>AHB1 peripheral reset register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1443</resetMask>
          <fields>
            <field>
              <name>DMA1RST</name>
              <description>desc DMA1RST</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2RST</name>
              <description>desc DMA2RST</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CRCRST</name>
              <description>desc CRCRST</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIORST</name>
              <description>desc SDIORST</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ESMCRST</name>
              <description>desc ESMCRST</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2RSTR</name>
          <description>AHB2 peripheral reset register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7C</resetMask>
          <fields>
            <field>
              <name>IOPARST</name>
              <description>desc IOPARST</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOPBRST</name>
              <description>desc IOPBRST</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOPCRST</name>
              <description>desc IOPCRST</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOPDRST</name>
              <description>desc IOPDRST</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOPERST</name>
              <description>desc IOPERST</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2ENR</name>
          <description>AHB2 peripheral clock register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7C</resetMask>
          <fields>
            <field>
              <name>IOPAEN</name>
              <description>desc IOPAEN</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOPBEN</name>
              <description>desc IOPBEN</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOPCEN</name>
              <description>desc IOPCEN</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOPDEN</name>
              <description>desc IOPDEN</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IOPEEN</name>
              <description>desc IOPEEN</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>desc CFGR2</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0x3F0F</resetMask>
          <fields>
            <field>
              <name>CANCKSEL</name>
              <description>desc CANCKSEL</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSEDRV</name>
              <description>desc HSEDRV</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSESTART</name>
              <description>desc HSESTART</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>HSERFSEL</name>
              <description>desc HSERFSEL</description>
              <msb>13</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
