py32-rs/py32-data/svd/PY32F403xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WWDG</name>
      <description>desc WWDG</description>
      <groupName>WWDG</groupName>
      <baseAddress>0x40002C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WWDG</name>
        <description>desc WWDG</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>T</name>
              <description>desc T</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGA</name>
              <description>desc WDGA</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <description>desc CFR</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0x3FF</resetMask>
          <fields>
            <field>
              <name>W</name>
              <description>desc W</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WDGTB</name>
              <description>desc WDGTB</description>
              <msb>8</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EWI</name>
              <description>desc EWI</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>EWIF</name>
              <description>desc EWIF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>